mlnd_project_proposal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-24 Sun 01:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Saravanan Baskaran" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4fc77f4">1. Machine Learning Engineer Nanodegree</a>
<ul>
<li><a href="#orge25ca32">1.1. Capstone Proposal</a></li>
<li><a href="#orge1604e7">1.2. Proposal</a>
<ul>
<li><a href="#orgc5c73f8">1.2.1. Domain Background</a></li>
<li><a href="#org4480f57">1.2.2. Problem Statement</a></li>
<li><a href="#orgc584bfb">1.2.3. Datasets and Inputs</a></li>
<li><a href="#org2608fd2">1.2.4. Solution Statement</a></li>
<li><a href="#org22f53dd">1.2.5. Benchmark Model</a></li>
<li><a href="#org65b44dd">1.2.6. Evaluation Metrics</a></li>
<li><a href="#org20b356c">1.2.7. Project Design</a></li>
<li><a href="#org4264ccf">1.2.8. Future Work</a></li>
<li><a href="#orgc1f024e">1.2.9. Reference</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4fc77f4" class="outline-2">
<h2 id="org4fc77f4"><span class="section-number-2">1</span> Machine Learning Engineer Nanodegree</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge25ca32" class="outline-3">
<h3 id="orge25ca32"><span class="section-number-3">1.1</span> Capstone Proposal</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Saravanan Baskaran.
23 Dec 2017
</p>
</div>
</div>

<div id="outline-container-orge1604e7" class="outline-3">
<h3 id="orge1604e7"><span class="section-number-3">1.2</span> Proposal</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgc5c73f8" class="outline-4">
<h4 id="orgc5c73f8"><span class="section-number-4">1.2.1</span> Domain Background</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Now a days there are lot of data produced which are visual in nature. Many a times we get pictures and videos shared in social media in addition to text. In order to find the sentiment of a message it becomes necessary to use the visual content in addition to the textual content.This project attempts to build and train a deep learning model based on a research paper that classify an image as expressing positive, negative or neutral sentiment. The proposed model will be trained based on data collected from wild, ie without using any manually labeled data.
</p>

<p>
This project is based on the paper &#x2013; Cross-Media Learning for Image Sentiment Analysis in the Wild by
Lucia Vadicamo et al. Where they have outlined a method to use cross media learning to train a visual sentiment classifier. This is a first of kind approach where a classifier is trained using data from wild.
</p>

<p>
This is a very interesting pioneering effort in the field of visual sentiment classification. We try to replicate their results from the image classification part and then try to improve upon it. We will train models using the latest CNN architectures from imagenet contest <a href="http://www.image-net.org/challenges/LSVRC/">ILSVRC</a>, namely Inception and Mobilenet and compare their performance (accuracy, number of parameters and prediction speed) to the implementation of original models as described in the research paper. We will also evaluate our models with another human labeled dataset <a href="https://www.cs.rochester.edu/u/qyou/DeepSent/deepsentiment.htm">DeepSent</a> to check if we get comparable accuracy scores listed in their site.
</p>
</div>
</div>

<div id="outline-container-org4480f57" class="outline-4">
<h4 id="org4480f57"><span class="section-number-4">1.2.2</span> Problem Statement</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
We will use the labeled data from the B-T4SA dataset to train our models. We try to replicate the results from the experiment using the architecture described in the paper. It will be trained with the downloaded dataset and set as baseline models.
</p>

<p>
We will try to improve upon the result by fine tuning models based on InceptionV3 and Mobilenet architectures trained on imagenet data. We will compare the new models performance (accuracy, prediction time and number of parameters) to the baseline model. All these models will be trained using the same training and validation data and tested against the test set from the downloaded B-T4SA dataset and TDD dataset found at <a href="https://www.cs.rochester.edu/u/qyou/DeepSent/deepsentiment.htm">DeepSent</a>.
</p>
</div>
</div>

<div id="outline-container-orgc584bfb" class="outline-4">
<h4 id="orgc584bfb"><span class="section-number-4">1.2.3</span> Datasets and Inputs</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
As part of the paper, Lucia Vadicamo et al collected a dataset containing 3 million tweets with text and images. The images are labeled based on the content of the text in the tweet using an accurate classifier which works on text. It is then preprocessed to create a labeled image dataset containing balanced number of images(156,862) for each of the three classes. The dataset is available online and can be downloaded from <a href="http://www.t4sa.it">T4SA</a>
</p>

<p>
We use the B-T4SA dataset to train and test our models. The data set consist of images collected from twitter which are labeled as positive, neutral or negative using the text content. We have 156,862 images for each category with a total of 470,586 images. This is a balanced dataset which contains equal number of examples from each category.
</p>
</div>
</div>

<div id="outline-container-org2608fd2" class="outline-4">
<h4 id="org2608fd2"><span class="section-number-4">1.2.4</span> Solution Statement</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
We will use a Vgg19 model trained on imagenet and finetune all its layers and call it Vgg19-T4SA-A and only the FC layers and call it Vgg19-T4SA-F. We should check that we achieve an accuracy as listed in the table on B-T4SA test set and on <a href="https://www.cs.rochester.edu/u/qyou/DeepSent/deepsentiment.htm">DeepSent</a> test data which is called Twitter Testing Data, abbreviated as TTD. TTD had 3 sets of data based on the number of workers agreement to the classification. We have TTD 5 where all the 5 workers agreed on a label and it contains data with high confidence. TTD 4 contains samples where 4 workers agreed on the majority label and similarly TTD 3 contains samples where 3 agreed on the majority label. These models and their accuracy scores are used as baseline to test and compare to other models.
</p>

<p>
[Tabel1]
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Model</th>
<th scope="col" class="org-right">TTD 5 agree</th>
<th scope="col" class="org-right">TTD 4 agree</th>
<th scope="col" class="org-right">TTD 3 agree</th>
<th scope="col" class="org-right">B-T4SA Testset</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Vgg19-T4SA-F</td>
<td class="org-right">0.768</td>
<td class="org-right">0.737</td>
<td class="org-right">0.715</td>
<td class="org-right">0.506</td>
</tr>

<tr>
<td class="org-left">Vgg19-T4SA-A</td>
<td class="org-right">0.785</td>
<td class="org-right">0.755</td>
<td class="org-right">0.725</td>
<td class="org-right">0.513</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
We finetune two models based on InceptionV3 architecture trained on imagenet with the B-T4SA training dataset. We finetune all layers in model and call in InceptionV3-T4SA-A and only the FC layers in another model and call it InceptionV3-T4SA-F. We finetune two more models based on Mobilenet architecture on all and FC layers and call them Mobilenet-T4SA-A and Mobilenet-T4SA-F respectively
</p>

<p>
Both model must achieve comparable performance to the Vgg19-T4SA-F and Vgg19-T4SA-A. The accuracy on TTD and B-T4SA should be within 5% of the accuracy of the baseline models. We expect the new models to have a better accuracy and performance than the baseline models.
</p>
</div>
</div>

<div id="outline-container-org22f53dd" class="outline-4">
<h4 id="org22f53dd"><span class="section-number-4">1.2.5</span> Benchmark Model</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
We use the  Vgg19-T4SA-F and Vgg19-T4SA-A as benchmark models. We compare the score and performance of InceptionV3-T4SA-F, InceptionV3-T4SA-A, Mobilenet-T4SA-F, Mobilenet-T4SA-A to the baseline models.
</p>

<p>
We expect our model to have comparable or better score and performance to the base models.
</p>
</div>
</div>

<div id="outline-container-org65b44dd" class="outline-4">
<h4 id="org65b44dd"><span class="section-number-4">1.2.6</span> Evaluation Metrics</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
The models are evaluated on the accuracy score they reach on the TTD 5, TTD 4, TTD 3 and B-T4SA test set.
We record the prediction time on TTD5 test set to find the model that takes less time in predicting the result. We also compare the number of parameters of each model which acts as surrogate measure for memory usage of the models.
</p>

<p>
We expect the new models InceptionV3-T4SA-F, InceptionV3-T4SA-A, Mobilenet-T4SA-F, Mobilenet-T4SA-A to be better than baseline models in terms of accuracy and performance metrics we defined.
</p>
</div>
</div>

<div id="outline-container-org20b356c" class="outline-4">
<h4 id="org20b356c"><span class="section-number-4">1.2.7</span> Project Design</h4>
<div class="outline-text-4" id="text-1-2-7">
<p>
We use keras running on top of tensorflow to design our models. We will use the VGG19 trained on imagenet and finetune all the layers and only fully connected layers on two instances and get Vgg19-T4SA-A and Vgg19-T4SA-F which are set as baseline models. The results from this model will be compared to the results in <a href="http://www.t4sa.it/">T4SA</a> to check if our baseline is correct.
They should reach an accuracy as given in table Table1 on the TTD and B-T4SA dataset.
</p>

<p>
Next we finetune a model based on InceptionV3 architecture trained on imagenet. We finetune two instance of this model, where we finetune FC layers for one of the model and all layers in another. We get two models finetuned on two different set of layers InceptionV3-T4SA-F, InceptionV3-T4SA-A which will be compared with the base model. Similarly we will also finetune a set of models  Mobilenet-T4SA-F, Mobilenet-T4SA-A  based on Mobilenet architecture which will be used in the comparison against the base model.
</p>

<p>
It is expected that the InceptionV3 based model to train faster and more accurate than the baseline model. The Mobilenet based model is expected to perform well in memory utilization and in prediction in terms of running time and may have less accuracy than baseline. We will try to tune the Mobilenet model to give as good accuracy as baseline models.
</p>
</div>
</div>

<div id="outline-container-org4264ccf" class="outline-4">
<h4 id="org4264ccf"><span class="section-number-4">1.2.8</span> Future Work</h4>
<div class="outline-text-4" id="text-1-2-8">
<ul class="org-ul">
<li>Improve the accuracy of classifier by using both the image and textual features together and check its effect on the TTD and B-T4SA test set.</li>
<li>Collect data using amazon mechanical truck on tweets containing both text and images in English and check the performance of the combined model on this human labeled data.</li>
<li>Create a web application using the top performing model that classifies an image given an url as having positive, negative or neutral sentiment content.</li>
<li>Do the reverse. Finetune an InceptionV3 model trained on imagenet with augmented version on images from DeepSenti and compare the performance on  B-T4SA test set to see if we can get away with less data</li>
<li>Explore on using the complete data set from T4SA to further improve the scores. Use class weights to account for unbalanced class distribution in the dataset.</li>
</ul>
</div>
</div>


<div id="outline-container-orgc1f024e" class="outline-4">
<h4 id="orgc1f024e"><span class="section-number-4">1.2.9</span> Reference</h4>
<div class="outline-text-4" id="text-1-2-9">
<ul class="org-ul">
<li>T4SA &#x2013; <a href="http://www.t4sa.it/">http://www.t4sa.it/</a></li>
<li>DeepSent &#x2013; <a href="https://www.cs.rochester.edu/u/qyou/DeepSent/deepsentiment.html">https://www.cs.rochester.edu/u/qyou/DeepSent/deepsentiment.html</a></li>
<li>Cross-Media Learning for Image Sentiment Analysis in the Wild by</li>
</ul>
<p>
Lucia Vadicamo et al &#x2013; <a href="http://openaccess.thecvf.com/content_ICCV_2017_workshops/papers/w5/Vadicamo_Cross-Media_Learning_for_ICCV_2017_paper.pdf">http://openaccess.thecvf.com/content_ICCV_2017_workshops/papers/w5/Vadicamo_Cross-Media_Learning_for_ICCV_2017_paper.pdf</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Saravanan Baskaran</p>
<p class="date">Created: 2017-12-24 Sun 01:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
